; domain
;; STRIPS domain of the STAR Puzzle

(define (domain star-puzzle)
  (:requirements :strips)
  (:predicates 
        (post_o ?o)  ; is at Post O?
        (on ?x ?y) ; x is on y
    	(smaller ?s ?l) ; s is smaller than l
    	(clear ?z) ; clear to move or clear to be moved on
    )

    ; Move from a post to post O
  (:action MOVETO
    :parameters (?disk ?from ?to)
    :precondition (and (post_o ?to) (smaller ?disk ?to) (on ?disk ?from) (clear ?disk) (clear ?to))
    :effect  (and (on ?disk ?to) (clear ?from) (not (on ?disk ?from)) (not (post_o ?to)) (post_o ?disk) (not (clear ?to))))

    ; Move from post O to a post 
  (:action MOVEFROM
    :parameters (?disk ?from ?to)
    :precondition (and (post_o ?disk) (smaller ?disk ?to) (on ?disk ?from) (clear ?disk) (clear ?to))
    :effect  (and (on ?disk ?to) (clear ?from) (not (on ?disk ?from)) (not (post_o ?disk)) (post_o ?from) (not (clear ?to))))

)

; problem
;; STRIPS Instance problem for the Star Puzzle with 4 disks

(define (problem star-puzzle-4)
  (:domain star-puzzle)
  (:objects PA PB PC PO
    D1 D2 D3 D4)
  (:init
   ;; types
   (post_o PO) ; initializing Post O

  ;; locations and properties
   (smaller D1 PA) (smaller D2 PA) (smaller D3 PA) (smaller D4 PA)
   (smaller D1 PB) (smaller D2 PB) (smaller D3 PB) (smaller D4 PB)
   (smaller D1 PC) (smaller D2 PC) (smaller D3 PC) (smaller D4 PC)
   (smaller D1 PO) (smaller D2 PO) (smaller D3 PO) (smaller D4 PO)
   (smaller D1 D2) (smaller D1 D3) (smaller D1 D4) 
   (smaller D2 D3) (smaller D2 D4) 
   (smaller D3 D4)
   
   (clear PB) (clear PC) (clear PO) (clear D1)
   (on D4 PA) (on D3 D4) (on D2 D3) (on D1 D2))

  (:goal
   (and (on D4 PC) (on D3 D4) (on D2 D3) (on D1 D2)))

)

; plan
1. (moveto d1 d2 po)
   deleted: (on d1 d2) (post_o po) (clear po)
   added: (on d1 po) (clear d2) (post_o d1)
   goals met: 2 of 4
2. (movefrom d1 po pb)
   deleted: (on d1 po) (post_o d1) (clear pb)
   added: (on d1 pb) (clear po) (post_o po)
   goals met: 2 of 4
3. (moveto d2 d3 po)
   deleted: (on d2 d3) (post_o po) (clear po)
   added: (on d2 po) (clear d3) (post_o d2)
   goals met: 1 of 4
4. (movefrom d2 po pc)
   deleted: (on d2 po) (post_o d2) (clear pc)
   added: (on d2 pc) (clear po) (post_o po)
   goals met: 1 of 4
5. (moveto d3 d4 po)
   deleted: (on d3 d4) (post_o po) (clear po)
   added: (on d3 po) (clear d4) (post_o d3)
   goals met: 0 of 4
6. (moveto d2 pc d3)
   deleted: (on d2 pc) (post_o d3) (clear d3)
   added: (on d2 d3) (clear pc) (post_o d2)
   goals met: 1 of 4
7. (moveto d1 pb d2)
   deleted: (on d1 pb) (post_o d2) (clear d2)
   added: (on d1 d2) (clear pb) (post_o d1)
   goals met: 2 of 4
8. (movefrom d1 d2 d4)
   deleted: (on d1 d2) (post_o d1) (clear d4)
   added: (on d1 d4) (clear d2) (post_o d2)
   goals met: 1 of 4
9. (movefrom d2 d3 pb)
   deleted: (on d2 d3) (post_o d2) (clear pb)
   added: (on d2 pb) (clear d3) (post_o d3)
   goals met: 0 of 4
10. (movefrom d3 po pc)
   deleted: (on d3 po) (post_o d3) (clear pc)
   added: (on d3 pc) (clear po) (post_o po)
   goals met: 0 of 4
11. (moveto d1 d4 po)
   deleted: (on d1 d4) (post_o po) (clear po)
   added: (on d1 po) (clear d4) (post_o d1)
   goals met: 0 of 4
12. (movefrom d1 po d2)
   deleted: (on d1 po) (post_o d1) (clear d2)
   added: (on d1 d2) (clear po) (post_o po)
   goals met: 1 of 4
13. (moveto d4 pa po)
   deleted: (on d4 pa) (post_o po) (clear po)
   added: (on d4 po) (clear pa) (post_o d4)
   goals met: 1 of 4
14. (moveto d3 pc d4)
   deleted: (on d3 pc) (post_o d4) (clear d4)
   added: (on d3 d4) (clear pc) (post_o d3)
   goals met: 2 of 4
15. (movefrom d3 d4 pa)
   deleted: (on d3 d4) (post_o d3) (clear pa)
   added: (on d3 pa) (clear d4) (post_o d4)
   goals met: 1 of 4
16. (movefrom d4 po pc)
   deleted: (on d4 po) (post_o d4) (clear pc)
   added: (on d4 pc) (clear po) (post_o po)
   goals met: 2 of 4
17. (moveto d3 pa po)
   deleted: (on d3 pa) (post_o po) (clear po)
   added: (on d3 po) (clear pa) (post_o d3)
   goals met: 2 of 4
18. (movefrom d3 po d4)
   deleted: (on d3 po) (post_o d3) (clear d4)
   added: (on d3 d4) (clear po) (post_o po)
   goals met: 3 of 4
19. (moveto d1 d2 po)
   deleted: (on d1 d2) (post_o po) (clear po)
   added: (on d1 po) (clear d2) (post_o d1)
   goals met: 2 of 4
20. (movefrom d1 po d3)
   deleted: (on d1 po) (post_o d1) (clear d3)
   added: (on d1 d3) (clear po) (post_o po)
   goals met: 2 of 4
21. (moveto d2 pb po)
   deleted: (on d2 pb) (post_o po) (clear po)
   added: (on d2 po) (clear pb) (post_o d2)
   goals met: 2 of 4
22. (moveto d1 d3 d2)
   deleted: (on d1 d3) (post_o d2) (clear d2)
   added: (on d1 d2) (clear d3) (post_o d1)
   goals met: 3 of 4
23. (movefrom d1 d2 pb)
   deleted: (on d1 d2) (post_o d1) (clear pb)
   added: (on d1 pb) (clear d2) (post_o d2)
   goals met: 2 of 4
24. (movefrom d2 po d3)
   deleted: (on d2 po) (post_o d2) (clear d3)
   added: (on d2 d3) (clear po) (post_o po)
   goals met: 3 of 4
25. (moveto d1 pb po)
   deleted: (on d1 pb) (post_o po) (clear po)
   added: (on d1 po) (clear pb) (post_o d1)
   goals met: 3 of 4
26. (movefrom d1 po d2)
   deleted: (on d1 po) (post_o d1) (clear d2)
   added: (on d1 d2) (clear po) (post_o po)
   goals met: 4 of 4
